12/data/attachments/b9a2c156f848a9b7.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Jacob_upon_Friend_30321_5</nif:username>
            <nif:friendToBeRequested>soap_friends_ccb6364d-4e0a-4708-8176-7131e5e87116</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>